In [31]:
import pandas as pd
df1 = pd.DataFrame({
    "city":["newyork","chicago","orlando", "baltimore"],
    "temperature" :[21,14,35, 29]
})
df1

        city  temperature
0    newyork           21
1    chicago           14
2    orlando           35
3  baltimore           29

In [34]:
import pandas as pd
df2 = pd.DataFrame({
    "city":["chicago","newyork","orlando","san fran"],
    "himidity" :[65,68,75,56]
})
df2

       city  himidity
0   chicago        65
1   newyork        68
2   orlando        75
3  san fran        56

In [35]:
import pandas as pd
df = pd.concat([df1,df2], axis = 1)
df

        city  temperature      city  himidity
0    newyork           21   chicago        65
1    chicago           14   newyork        68
2    orlando           35   orlando        75
3  baltimore           29  san fran        56

In [50]:
df = pd.merge(df1,df1, on ="city", suffixes =('_left', '_right'))
df

        city  temperature_left  temperature_right
0    newyork                21                 21
1    chicago                14                 14
2    orlando                35                 35
3  baltimore                29                 29